In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv("StudentsPerformance.csv")

In [4]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

# 1.Find out how many males and females participated in the test.

In [8]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [10]:
df['gender'].value_counts(normalize=True)

female    0.518
male      0.482
Name: gender, dtype: float64

# 2. What do you think about the students' parental level of education?

In [11]:
df['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [ ]:
#all parents are minimum hig school level education

# 3. Who scores the most on average for math, reading and writing based on
● Gender
● Test preparation course

In [19]:
#Gender

import warnings
warnings.filterwarnings('ignore')

df.groupby('gender')['math score','reading score','writing score'].mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [ ]:
#for math,male student scored higer on avg, while in reading and writing female student scored higher on avg

In [20]:
#Test preparation course

df.groupby('test preparation course')['math score','reading score','writing score'].mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
#more avg in completed,it indicate a more student are completed test preparation course

# 4. What do you think about the scoring variation for math, reading and writing based on

● Gender
● Test preparation course

In [21]:
# Gender

df.groupby('gender')['math score','reading score','writing score'].var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [ ]:
# varation of scores of all subject test are higher for femail student

In [22]:
#Test preparation course

df.groupby('test preparation course')['math score','reading score','writing score'].var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [ ]:
# varation of test scores for student  who completed test prepartion is lower than who did not attend test prepartion course

# 5. management give bonus points to the top 25% of
students based on their maths score

In [32]:
top25math=df['math score'].nlargest(int(len(df)*0.25))

In [37]:
pd.DataFrame(data=top25math)

     math score
515         100
516         100
517         100
996         100
997         100
..          ...
428          77
429          77
849          77
850          77
851          77

[250 rows x 1 columns]